sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/Alternative Configurations/HardwareProfile EXPLORER_16_ENC28J60 C30.h
// ENC28J60 I/O pins
#if defined(__PIC24FJ256GA110__)	// PIC24FJ256GA110 must place the ENC28J60 on SPI2 because PIC rev A3 SCK1 output pin is a PPS input only (fixed on A5, but demos use SPI2 for simplicity)
	#define ENC_CS_TRIS			(TRISFbits.TRISF12)	// Comment this line out if you are using the ENC424J600/624J600, MRF24WB0M, or other network controller.
	#define ENC_CS_IO			(LATFbits.LATF12)
	// SPI SCK, SDI, SDO pins are automatically controlled by the 
	// PIC24/dsPIC SPI module 
	#define ENC_SPI_IF			(IFS2bits.SPI2IF)
	#define ENC_SSPBUF			(SPI2BUF)
	#define ENC_SPISTAT			(SPI2STAT)
	#define ENC_SPISTATbits		(SPI2STATbits)
	#define ENC_SPICON1			(SPI2CON1)
	#define ENC_SPICON1bits		(SPI2CON1bits)
	#define ENC_SPICON2			(SPI2CON2)
#else	// SPI1 for all other processors
	#define ENC_CS_TRIS			(TRISGbits.TRISG9)	// Comment this line out if you are using the ENC424J600/624J600, MRF24WB0M, or other network controller.
	#define ENC_CS_IO			(LATGbits.LATG9)
	#define ENC_SPI_ID			ID_SPI2
    #define ENC_RST_TRIS        (TRISFbits.TRISF0)
    #define ENC_RST_IO          (LATFbits.LATF0)

	// SPI SCK, SDI, SDO pins are automatically controlled by the 
	// PIC24/dsPIC SPI module 
	//#define ENC_SPI_IF			(IFS2bits.SPI2IF)
	//#define ENC_SSPBUF			(SPI2BUF)
	//#define ENC_SPISTAT			(SPI2STAT)
	//#define ENC_SPISTATbits		(SPI2STATbits)
	//#define ENC_SPICON1			(SPI2CON1)
	//#define ENC_SPICON1bits		(SPI2CON1bits)
	//#define ENC_SPICON2			(SPI2CON2)
	//#define ENC_INT_TRIS		(TRISAbits.TRISA12)
	//#define ENC_INT_IF  		
#endif




#define MS1_Tris            TRISGbits.TRISG12   // выход MS1
#define MS2_Tris            TRISGbits.TRISG13   // выход MS2
#define SLEEP_Tris          TRISGbits.TRISG14   // выход SLEEP
#define RESET_Tris          TRISGbits.TRISG15   // выход RESET
#define MS1                 LATGbits.LATG12     // выход MS1
#define MS2                 LATGbits.LATG13     // выход MS2
#define SLEEP               LATGbits.LATG14     // выход SLEEP
#define RESET               LATGbits.LATG15     // выход RESET

//описание выводов port1
#define PORT1_NULL_Tris     TRISAbits.TRISA0    // вход NULL
#define PORT1_POS_Tris      TRISDbits.TRISD8    // вход POS
#define PORT1_POS2_Tris     TRISEbits.TRISE0    // вход POS2
#define PORT1_NULL          PORTAbits.RA0       // вход NULL
#define PORT1_POS           PORTDbits.RD8       // вход POS
#define PORT1_POS2          PORTEbits.RE0       // вход POS2
#define PORT1_ENABLE_Tris   TRISAbits.TRISA9    // выход ENABLE
#define PORT1_DIR_Tris      TRISBbits.TRISB8    // выход DIR
#define PORT1_STEP_Tris     TRISDbits.TRISD0    // выход STEP
#define PORT1_ENABLE        LATAbits.LATA9      // выход ENABLE
#define PORT1_DIR           LATBbits.LATB8      // выход DIR
#define PORT1_STEP          LATDbits.LATD0      // выход STEP

//инициализация выводов port2
#define PORT2_NULL_Tris TRISAbits.TRISA1 // вход NULL
#define PORT2_POS_Tris TRISDbits.TRISD9 // вход POS
#define PORT2_POS2_Tris TRISEbits.TRISE1 // вход POS2
#define PORT2_NULL PORTAbits.RA1 // вход NULL
#define PORT2_POS PORTDbits.RD9 // вход POS
#define PORT2_POS2 PORTEbits.RE1 // вход POS2
#define PORT2_ENABLE_Tris TRISAbits.TRISA10 // выход ENABLE
#define PORT2_DIR_Tris TRISBbits.TRISB9 // выход DIR
#define PORT2_STEP_Tris TRISDbits.TRISD1 // выход STEP
#define PORT2_ENABLE LATAbits.LATA10 // выход ENABLE
#define PORT2_DIR LATBbits.LATB9 // выход DIR
#define PORT2_STEP LATDbits.LATD1 // выход STEP

//инициализация выводов port3
#define PORT3_NULL_Tris TRISAbits.TRISA2 // вход NULL
#define PORT3_POS_Tris TRISDbits.TRISD10 // вход POS
#define PORT3_POS2_Tris TRISEbits.TRISE2 // вход POS2
#define PORT3_NULL PORTAbits.RA2 // вход NULL
#define PORT3_POS PORTDbits.RD10 // вход POS
#define PORT3_POS2 PORTEbits.RE2 // вход POS2
#define PORT3_ENABLE_Tris TRISAbits.TRISA9 // выход ENABLE
#define PORT3_DIR_Tris TRISBbits.TRISB10 // выход DIR
#define PORT3_STEP_Tris TRISDbits.TRISD2 // выход STEP
#define PORT3_ENABLE LATAbits.LATA9 // выход ENABLE
#define PORT3_DIR LATBbits.LATB10 // выход DIR
#define PORT3_STEP LATDbits.LATD2 // выход STEP

//инициализация выводов port4
#define PORT4_NULL_Tris TRISAbits.TRISA3 // вход NULL
#define PORT4_POS_Tris TRISDbits.TRISD11 // вход POS
#define PORT4_POS2_Tris TRISEbits.TRISE3 // вход POS2
#define PORT4_NULL PORTAbits.RA3 // вход NULL
#define PORT4_POS PORTDbits.RD11 // вход POS
#define PORT4_POS2 PORTEbits.RE3 // вход POS2
#define PORT4_ENABLE_Tris TRISAbits.TRISA9 // выход ENABLE
#define PORT4_DIR_Tris TRISBbits.TRISB11 // выход DIR
#define PORT4_STEP_Tris TRISDbits.TRISD3 // выход STEP
#define PORT4_ENABLE LATAbits.LATA9 // выход ENABLE
#define PORT4_DIR LATBbits.LATB11 // выход DIR
#define PORT4_STEP LATDbits.LATD3 // выход STEP

//инициализация выводов port5
#define PORT5_NULL_Tris TRISAbits.TRISA4 // вход NULL
#define PORT5_POS_Tris TRISDbits.TRISD12 // вход POS
#define PORT5_POS2_Tris TRISEbits.TRISE4 // вход POS2
#define PORT5_NULL PORTAbits.RA4 // вход NULL
#define PORT5_POS PORTDbits.RD12 // вход POS
#define PORT5_POS2 PORTEbits.RE4 // вход POS2
#define PORT5_ENABLE_Tris TRISAbits.TRISA9 // выход ENABLE
#define PORT5_DIR_Tris TRISBbits.TRISB12 // выход DIR
#define PORT5_STEP_Tris TRISDbits.TRISD4 // выход STEP
#define PORT5_ENABLE LATAbits.LATA9 // выход ENABLE
#define PORT5_DIR LATBbits.LATB12 // выход DIR
#define PORT5_STEP LATDbits.LATD4 // выход STEP

//инициализация выводов port6
#define PORT6_NULL_Tris TRISAbits.TRISA5 // вход NULL
#define PORT6_POS_Tris TRISDbits.TRISD13 // вход POS
#define PORT6_POS2_Tris TRISEbits.TRISE5 // вход POS2
#define PORT6_NULL PORTAbits.RA5 // вход NULL
#define PORT6_POS PORTDbits.RD13 // вход POS
#define PORT6_POS2 PORTEbits.RE5 // вход POS2
#define PORT6_ENABLE_Tris TRISAbits.TRISA9 // выход ENABLE
#define PORT6_DIR_Tris TRISBbits.TRISB13 // выход DIR
#define PORT6_STEP_Tris TRISDbits.TRISD5 // выход STEP
#define PORT6_ENABLE LATAbits.LATA9 // выход ENABLE
#define PORT6_DIR LATBbits.LATB13 // выход DIR
#define PORT6_STEP LATDbits.LATD5 // выход STEP

