sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/Alternative Configurations/HardwareProfile EXPLORER_16_ENC28J60 C30.h
//#if defined(__PIC24FJ256GA110__)	// The PIC24FJ256GA110 must use SPI2 slot on Explorer 16.  If you don't have a PIC24FJ256GA110 but want to use SPI2 for some reason, you can use these definitions.
//	#define ENC100_ISR_ENABLE		(IEC3bits.INT4IE)
//	#define ENC100_ISR_FLAG			(IFS3bits.INT4IF)
//	#define ENC100_ISR_POLARITY		(INTCON2bits.INT4EP)
//	#define ENC100_ISR_PRIORITY		(IPC13bits.INT4IP)
//	#define ENC100_SPI_ENABLE		(ENC100_SPISTATbits.SPIEN)
//	#define ENC100_SPI_IF			(IFS1bits.SPI2IF)
//	#define ENC100_SSPBUF			(SPI2BUF)
//	#define ENC100_SPISTAT			(SPI2STAT)
//	#define ENC100_SPISTATbits		(SPI2STATbits)
//	#define ENC100_SPICON1			(SPI2CON1)
//	#define ENC100_SPICON1bits		(SPI2CON1bits)
//	#define ENC100_SPICON2			(SPI2CON2)
//#else	// All other PIC24s and dsPICs use SPI1 slot (top most closest to LCD)
//	#define ENC100_ISR_ENABLE		(IEC1bits.INT2IE)
//	#define ENC100_ISR_FLAG			(IFS1bits.INT2IF)
//	#define ENC100_ISR_POLARITY		(INTCON2bits.INT2EP)
//	#define ENC100_ISR_PRIORITY		(IPC7bits.INT2IP)
//	#define ENC100_SPI_ENABLE		(ENC100_SPISTATbits.SPIEN)
//	#define ENC100_SPI_IF			(IFS0bits.SPI1IF)
//	#define ENC100_SSPBUF			(SPI1BUF)
//	#define ENC100_SPISTAT			(SPI1STAT)
//	#define ENC100_SPISTATbits		(SPI1STATbits)
//	#define ENC100_SPICON1			(SPI1CON1)
//	#define ENC100_SPICON1bits		(SPI1CON1bits)
//	#define ENC100_SPICON2			(SPI1CON2)
//#endif


// 25LC256 I/O pins
#if defined(__PIC24FJ256GB110__)
	// PIC24FJ256GB110 USB PIM has RD12 pin on Explorer 16 schematic 
	// remapped and actually connected to PIC24FJ256GB110 pin 90 (RG0).  
	//#define EEPROM_CS_TRIS		(TRISGbits.TRISG0)
	//#define EEPROM_CS_IO		(LATGbits.LATG0)
#elif defined(__PIC24FJ256GB210__)
	// PIC24FJ256GB210 USB PIM has RD12 pin on Explorer 16 schematic 
	// remapped and actually connected to PIC24FJ256GB210 pin 90 (RG0) when 
	// JP1 on PIM has pins 1-2 shorted (USB).  When JP1 pins 2-3 are shorted 
	// (PMP), PIC pin 90 does connect to RD12.  To make the PIM work with 
	// either jumper setting, we will drive both RG0 and RD12 simultaneously
	// as chip select to the same states.  For an actual application, you'd 
	// want to specify only the single necessary pin as this double 
	// assignment operation generates inefficient code by the C compiler.
	//#define EEPROM_CS_TRIS		TRISGbits.TRISG0 = TRISDbits.TRISD12
	//#define EEPROM_CS_IO		LATGbits.LATG0 = LATDbits.LATD12
#else
	//#define EEPROM_CS_TRIS		(TRISDbits.TRISD12)
	//#define EEPROM_CS_IO		(LATDbits.LATD12)
#endif
/*
#define EEPROM_SCK_TRIS		(TRISGbits.TRISG6)
#define EEPROM_SDI_TRIS		(TRISGbits.TRISG7)
#define EEPROM_SDO_TRIS		(TRISGbits.TRISG8)
#define EEPROM_SPI_IF		(IFS2bits.SPI2IF)
#define EEPROM_SSPBUF		(SPI2BUF)
#define EEPROM_SPICON1		(SPI2CON1)
#define EEPROM_SPICON1bits	(SPI2CON1bits)
#define EEPROM_SPICON2		(SPI2CON2)
#define EEPROM_SPISTAT		(SPI2STAT)
#define EEPROM_SPISTATbits	(SPI2STATbits)
*/
// LCD Module I/O pins.  NOTE: On the Explorer 16, the LCD is wired to the 
// same PMP lines required to communicate with an ENCX24J600 in parallel 
// mode.  Since the LCD does not have a chip select wire, if you are using 
// the ENC424J600/624J600 in parallel mode, the LCD cannot be used.
/*#if !defined(ENC100_INTERFACE_MODE) || (ENC100_INTERFACE_MODE == 0)	// SPI only
	#define LCD_DATA_TRIS		(*((volatile unsigned char*)&TRISE))
	#define LCD_DATA_IO			(*((volatile unsigned char*)&LATE))
	#define LCD_RD_WR_TRIS		(TRISDbits.TRISD5)
	#define LCD_RD_WR_IO		(LATDbits.LATD5)
	#define LCD_RS_TRIS			(TRISBbits.TRISB15)
	#define LCD_RS_IO			(LATBbits.LATB15)
	#define LCD_E_TRIS			(TRISDbits.TRISD4)
	#define LCD_E_IO			(LATDbits.LATD4)
#endif
*/

//// Serial Flash/SRAM/UART PICtail Plus attached to SPI2 (middle pin group)
//// This daughter card is not in production, but if you custom attach an SPI 
//// RAM or SPI Flash chip to your board, then use these definitions as a 
//// starting point.
//#define SPIRAM_CS_TRIS			(TRISGbits.TRISG9)
//#define SPIRAM_CS_IO			(LATGbits.LATG9)
//#define SPIRAM_SCK_TRIS			(TRISGbits.TRISG6)
//#define SPIRAM_SDI_TRIS			(TRISGbits.TRISG7)
//#define SPIRAM_SDO_TRIS			(TRISGbits.TRISG8)
//#define SPIRAM_SPI_IF			(IFS2bits.SPI2IF)
//#define SPIRAM_SSPBUF			(SPI2BUF)
//#define SPIRAM_SPICON1			(SPI2CON1)
//#define SPIRAM_SPICON1bits		(SPI2CON1bits)
//#define SPIRAM_SPICON2			(SPI2CON2)
//#define SPIRAM_SPISTAT			(SPI2STAT)
//#define SPIRAM_SPISTATbits		(SPI2STATbits)

#define SPIFLASH_CS_TRIS		(TRISFbits.TRISF5)
#define SPIFLASH_CS_IO			(LATFbits.LATF5)
#define SPIRTCSRAM_CS_TRIS		(TRISFbits.TRISF13)
#define SPIRTCSRAM_CS_IO		(LATFbits.LATF13)

#ifdef VER_1 //исходная
#   define SPIRTCSRAM_SPI_ID		ID_SPI2
#   define SPIFLASH_SPI_ID			ID_SPI2
#endif

#ifdef VER_2
#   define SPIFLASH_SPI_ID			ID_SPI1
#   define SPIRTCSRAM_SPI_ID		ID_SPI1
#endif
////----------------------------
//// MRF24WB0M WiFi I/O pins
////----------------------------
//// If you have a MRF24WB0M WiFi PICtail, you must uncomment one of 
//// these two lines to use it.  SPI1 is the top-most slot in the Explorer 16 
//// (closer to the LCD and prototyping area) while SPI2 corresponds to 
//// insertion of the PICtail into the middle of the side edge connector slot.
//#define MRF24WB0M_IN_SPI1
////#define MRF24WB0M_IN_SPI2
//
//// PIC24FJ256GA110 PIM on Explorer 16 must use SPI2, not SPI1
//#if defined(MRF24WB0M_IN_SPI1) && defined(__PIC24FJ256GA110__)
//	#undef MRF24WB0M_IN_SPI1
//	#define MRF24WB0M_IN_SPI2
//#endif
//
//#if defined(MRF24WB0M_IN_SPI1) && !defined(__32MX460F512L__) && !defined(__32MX795F512L__) && !defined(__PIC24FJ256GA110__)
//	// MRF24WB0M in SPI1 slot
//	#define WF_CS_TRIS			(TRISBbits.TRISB2)
//	#define WF_CS_IO			(LATBbits.LATB2)
//	#define WF_SDI_TRIS			(TRISFbits.TRISF7)
//	#define WF_SCK_TRIS			(TRISFbits.TRISF6)
//	#define WF_SDO_TRIS			(TRISFbits.TRISF8)
//	#define WF_RESET_TRIS		(TRISFbits.TRISF0)
//	#define WF_RESET_IO			(LATFbits.LATF0)
//	#if defined(__dsPIC33FJ256GP710__) || defined(__PIC24HJ256GP610__)
//		#define WF_INT_TRIS	    (TRISAbits.TRISA12)
//		#define WF_INT_IO		(PORTAbits.RA12)
//	#else
//		#define WF_INT_TRIS	    (TRISEbits.TRISE8)  // INT1
//		#define WF_INT_IO		(PORTEbits.RE8)
//	#endif
//	#define WF_HIBERNATE_TRIS	(TRISFbits.TRISF1)
//	#define	WF_HIBERNATE_IO		(PORTFbits.RF1)
//	#define WF_INT_EDGE			(INTCON2bits.INT1EP)
//	#define WF_INT_IE			(IEC1bits.INT1IE)
//	#define WF_INT_IF			(IFS1bits.INT1IF)
//
//	#define WF_SSPBUF			(SPI1BUF)
//	#define WF_SPISTAT			(SPI1STAT)
//	#define WF_SPISTATbits		(SPI1STATbits)
//	#define WF_SPICON1			(SPI1CON1)
//	#define WF_SPICON1bits		(SPI1CON1bits)
//	#define WF_SPICON2			(SPI1CON2)
//	#define WF_SPI_IE			(IEC0bits.SPI1IE)
////	#define WF_SPI_IP			(IPC2bits.SPI1IP)
//	#define WF_SPI_IF			(IFS0bits.SPI1IF)
//
//#elif defined(MRF24WB0M_IN_SPI2) && !defined(__32MX460F512L__) && !defined(__32MX795F512L__)
//	// MRF24WB0M in SPI2 slot
//	#define WF_CS_TRIS			(TRISGbits.TRISG9)
//	#define WF_CS_IO			(LATGbits.LATG9)
//	#define WF_SDI_TRIS			(TRISGbits.TRISG7)
//	#define WF_SCK_TRIS			(TRISGbits.TRISG6)
//	#define WF_SDO_TRIS			(TRISGbits.TRISG8)
//	#define WF_RESET_TRIS		(TRISGbits.TRISG0)
//	#define WF_RESET_IO			(LATGbits.LATG0)
//	#if defined(__PIC24FJ256GB110__) || defined(__PIC24FJ256GB210__)
//		#define WF_INT_TRIS			(TRISCbits.TRISC3)	// INT3
//		#define WF_INT_IO			(PORTCbits.RC3)
//	#else
//		#define WF_INT_TRIS			(TRISAbits.TRISA14)	// INT3
//		#define WF_INT_IO			(PORTAbits.RA14)
//	#endif
//	#define WF_HIBERNATE_TRIS		(TRISGbits.TRISG1)
//	#define	WF_HIBERNATE_IO			(PORTGbits.RG1)
//	#define WF_INT_EDGE			(INTCON2bits.INT3EP)
//	#define WF_INT_IE			(IEC3bits.INT3IE)
//	#define WF_INT_IF			(IFS3bits.INT3IF)
//
//	#define WF_SSPBUF			(SPI2BUF)
//	#define WF_SPISTAT			(SPI2STAT)
//	#define WF_SPISTATbits		(SPI2STATbits)
//	#define WF_SPICON1			(SPI2CON1)
//	#define WF_SPICON1bits		(SPI2CON1bits)
//	#define WF_SPICON2			(SPI2CON2)
//	#define WF_SPI_IE			(IEC2bits.SPI2IE)
////	#define WF_SPI_IP			(IPC8bits.SPI2IP)
//	#define WF_SPI_IF			(IFS2bits.SPI2IF)
//
//#endif


// Select which UART the STACK_USE_UART and STACK_USE_UART2TCP_BRIDGE 
// options will use.  You can change these to U1BRG, U1MODE, etc. if you 
// want to use the UART1 module instead of UART2.
#define UBRG				U2BRG
#define UMODE				U2MODE
#define USTA				U2STA
#define BusyUART()			BusyUART2()
#define CloseUART()			CloseUART2()
#define ConfigIntUART(a)	ConfigIntUART2(a)
#define DataRdyUART()		DataRdyUART2()
#define OpenUART(a,b,c)		OpenUART2(a,b,c)
#define ReadUART()			ReadUART2()
#define WriteUART(a)		WriteUART2(a)
#define getsUART(a,b,c)		getsUART2(a,b,c)
#define putsUART(a)			putsUART2((unsigned int*)a)
#define getcUART()			getcUART2()
#define putcUART(a)			do{while(BusyUART()); WriteUART(a); while(BusyUART()); }while(0)
#define putrsUART(a)		putrsUART2(a)


#endif // #ifndef HARDWARE_PROFILE_H
